Repository: pingfangx/TranslatorX-other
Catalog: miscellaneous/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: SHA-1 is deprecated, and it is RECOMMENDED that any endpoint receiving any certificate which it would need to validate using any signature algorithm using a SHA-1 hash abort the handshake with a "bad_certificate" alert.
zh_cn: 不推荐使用 SHA-1，并且建议如果端点收到的证书的验证需要用使用 SHA-1 哈希的签名算法，就使用“bad_certificate”警报中止握手。

source: SND.NXT - send next
zh_cn: SND.NXT - 发送下一个

source: SND.NXT = next sequence number to be sent
zh_cn: SND.NXT =要发送的下一个序列号

source: SND.UNA - send unacknowledged
zh_cn: SND.UNA - 发送未确认的

source: SND.UNA = oldest unacknowledged sequence number
zh_cn: SND.UNA =最早的未确认序列号

source: SND.UP - send urgent pointer
zh_cn: SND.UP - 发送紧急指针

source: SND.WL1 - segment sequence number used for last window update
zh_cn: SND.WL1 - 用于最后一次窗口更新的报文段序列号

source: SND.WL2 - segment acknowledgment number used for last window update
zh_cn: SND.WL2 - 用于最后一次窗口更新的报文段确认号

source: SND.WND - send window
zh_cn: SND.WND - 发送窗口

source: SP = <US-ASCII SP, space (32)>
zh_cn: SP = <US-ASCII SP, 空格 (32)>

source: SSL, and its successor TLS [RFC2246] were designed to provide channel-oriented security.
zh_cn: SSL 及其后继 TLS [RFC2246] 旨在提供面向通道的安全性。

source: SYN-RECEIVED - represents waiting for a confirming connection request acknowledgment after having both received and sent a connection request.
zh_cn: SYN-RECEIVED - 表示在收到并发送连接请求后等待确认连接请求确认。

source: SYN-SENT - represents waiting for a matching connection request after having sent a connection request.
zh_cn: SYN-SENT - 表示在发送连接请求后等待匹配的连接请求。

source: SYN: Synchronize sequence numbers
zh_cn: SYN：同步序列号

source: Safe Methods
zh_cn: 安全方法

source: Safe and Idempotent Methods
zh_cn: 安全和幂等方法

source: Same-Document Reference
zh_cn: 同一文档引用

source: Scheme names consist of a sequence of characters beginning with a letter and followed by any combination of letters, digits, plus ("+"), period ("."), or hyphen ("-").
zh_cn: 方案名称由一系列以字母开头的字符组成，后跟字母，数字，加号(“+”)，句号(“.”)或连字符(“ - ”)的任意组合。

source: Scheme specifications will not define fragment identifier syntax or usage, regardless of its applicability to resources identifiable via that scheme, as fragment identification is orthogonal to scheme definition.
zh_cn: 方案规范将不定义片段标识符语法或用法，而不管其对通过该方案可识别的资源的适用性，因为片段标识与方案定义正交。

source: Scope
zh_cn: 范围

source: Section 2.4 describes when percent-encoding and decoding is applied.
zh_cn: 第 2.4 节描述了何时应用百分比编码和解码。

source: Section 4.4 defines how the transfer-length of a message-body is determined.
zh_cn: 第 4.4 节定义了如何确定消息体的传输长度。

source: Sections 7.4.2 and 7.4.3 describe the appropriate rules.
zh_cn: 7.4.2 和 7.4.3 节描述了适当的规则。

source: Secure hash functions (e.g., SHA-1, etc.) are used for MAC computations.
zh_cn: 安全散列函数(例如，SHA-1 等)用于 MAC 计算。

source: Security Considerations
zh_cn: 安全考虑因素

source: Security issues are discussed throughout this memo, especially in Appendices D, E, and F.
zh_cn: 安全问题在这份备忘录中讨论，尤其是在附录 D，E 和 F。

source: See Also
zh_cn: 相关参考

source: See Appendix A.1.2 for more information on backwards compatibility with HTTP/1.0 clients.
zh_cn: 有关向后兼容 HTTP/1.0 客户端的更多信息，请参阅附录 A.1.2。

source: See Appendix C for additional information.
zh_cn: 有关其他信息，请参阅附录 C。

source: See Appendix E for a more complete statement of the relevant security properties.
zh_cn: 有关相关安全属性的更完整声明，请参阅附录 E。

source: See Appendix E for discussion about what record layer version number should be employed for ClientHello.
zh_cn: 有关 ClientHello 应采用哪种记录层版本号的讨论，请参阅附录 E。

source: See RFC 2145 [36] for a fuller explanation.
zh_cn: 有关更全面的解释，请参阅 RFC 2145 [36]。

source: See Section 4.6.1 for details regarding the use of the max_early_data_size field.
zh_cn: 有关使用 max_early_data_size 字段的详细信息，请参见第 4.6.1 节。

source: See Section 5.4 for more details.
zh_cn: 更多详细信息，请参见第 5.4 节。

source: See Section 6 of [RFC7231] for information about the semantics of status codes, including the classes of status code (indicated by the first digit), the status codes defined by this specification, considerations for the definition of new status codes, and the IANA registry.
zh_cn: 有关状态代码语义的信息，请参见 [RFC7231] 的第 6 节，包括状态代码类(由第一个数字表示)，本规范定义的状态代码，新状态代码定义的注意事项以及 IANA 中注册。

source: See Section 7.4.3 for the KeyExchangeAlgorithm definition.
zh_cn: 有关 KeyExchangeAlgorithm 定义，请参见第 7.4.3 节。

source: See Section 9 for security considerations regarding message routing.
zh_cn: 有关消息路由的安全注意事项，请参见第 9 节。

source: See Section 9.1 for security considerations related to establishing authority.
zh_cn: 有关建立权限的安全性考虑，请参见第 9.1 节。

source: See [RFC8422] and [RFC7919].
zh_cn: 参见 [RFC8422] 和 [RFC7919]。

source: See section 15.1.3 for security considerations when used for forms.
zh_cn: 有关用于表单的安全注意事项，请参见第 15.1.3 节。

source: See section 15.1.3 for security considerations.
zh_cn: 有关安全性的考虑，请参见第 15.1.3 节。

source: See section 19.3 for further information.
zh_cn: 有关详细信息，请参见第 19.3 节。

source: See section 19.6.2 for more information on backward compatibility with HTTP/1.0 clients.
zh_cn: 有关与 HTTP/1.0 客户端向后兼容的更多信息，请参见第 19.6.2 节。

source: See section 3.4.1 for compatibility problems.
zh_cn: 有关兼容性问题，请参见第 3.4.1 节。

source: See the differences between version 1.x and 2.x in the wiki article [What's different in 2.0](https://github.com/ReactiveX/RxJava/wiki/What's-different-in-2.0).
zh_cn: 请参阅 wiki 文章中的版本 1.x 和 2.x 之间的差异 [What's different in 2.0](https://github.com/ReactiveX/RxJava/wiki/What's-different-in-2.0).

source: Segment contents are shown in abbreviated form, with sequence number, control flags, and ACK field.
zh_cn: 报文段内容以缩写形式显示，具有序列号，控制标志和 ACK 字段。

source: Send Sequence Space
zh_cn: 发送序列空间

source: Send Sequence Variables
zh_cn: 发送序列变量

source: Senders wishing to defeat this behavior MAY include a charset parameter even when the charset is ISO-8859-1 and SHOULD do so when it is known that it will not confuse the recipient.
zh_cn: 希望打败此行为的可能包含 charset 参数，即使字符集是 ISO-8859-1，并且应该知道它不会混淆接收者。

source: Sent by the client in response to a hello request or by the server in response to a client hello after initial handshaking.
zh_cn: 由客户端响应 hello 请求或服务器在初始握手后响应客户端 hello 而发送。

source: Separate specifications may define matching rules for other certificate extensions.
zh_cn: 单独的规范可以定义其他证书扩展的匹配规则。

source: Separating Identification from Interaction .
zh_cn: 将识别与交互分离

source: Sequence Numbers
zh_cn: 序号

source: Sequence numbers are of type uint64 and may not exceed 2^64-1.
zh_cn: 序列号的类型为 uint64，不得超过 2^64-1。

source: Sequence numbers do not wrap.
zh_cn: 序列号不会回转重用(wrap)。

source: Server Behavior
zh_cn: 服务器行为

source: Server Certificate Selection
zh_cn: 服务器证书选择

source: Server Identity
zh_cn: 服务器标识

source: Server Key Exchange
zh_cn: 服务器密钥交换

source: Server response:
zh_cn: 服务器响应：

source: Server-Specified Expiration
zh_cn: 服务器指定的过期时间

source: Server-driven Negotiation
zh_cn: 服务器驱动的协商

source: Servers MAY abort the handshake upon receiving a ClientHello with legacy_version 0x0304 or later.
zh_cn: 服务器可以在收到带有 legacy_version 0x0304 或更高版本的 ClientHello 时中止握手。

source: Servers MAY check for violations of these rules and abort the handshake with an "illegal_parameter" alert if one is violated.
zh_cn: 服务器可以检查是否违反了这些规则，如果违反了规则，则使用“illegal_parameter”警报中止握手。

source: Servers MAY close the connection after sending the closure alert, thus generating an incomplete close on the client side.
zh_cn: 服务器可以在发送关闭警报后关闭连接，从而在客户端生成不完整的关闭。

source: Servers MAY send data after sending their first flight, but because the handshake is not yet complete, they have no assurance of either the peer's identity or its liveness (i.e., the ClientHello might have been replayed).
zh_cn: 服务器可以在发送第一个航班后发送数据，但由于握手尚未完成，因此无法保证对等端的身份或其活跃性(即，ClientHello 可能已被重播)。

source: Servers MUST NOT include MD5 and SHA-1 in ServerKeyExchange message.
zh_cn: 服务器不得在 ServerKeyExchange 消息中包含 MD5 和 SHA-1。

source: Servers MUST NOT select a key exchange mode that is not listed by the client.
zh_cn: 服务器不能选择客户端未列出的密钥交换模式。

source: Servers MUST NOT send a KeyShareEntry for any group not indicated in the client's "supported_groups" extension and MUST NOT send a KeyShareEntry when using the "psk_ke" PskKeyExchangeMode.
zh_cn: 服务器不得为客户端的“supported_groups”扩展中未指示的任何组发送 KeyShareEntry，并且在使用“psk_ke”PskKeyExchangeMode 时不得发送 KeyShareEntry。

source: Servers MUST NOT send a post-handshake CertificateRequest to clients which do not offer this extension.
zh_cn: 服务器不得向不提供此扩展的客户端发送握手后的 CertificateRequest。

source: Servers MUST NOT send this extension.
zh_cn: 服务器不得发送此扩展。

source: Servers MUST NOT send this message, and clients receiving it MUST terminate the connection with an "unexpected_message" alert.
zh_cn: 服务器不得发送此消息，接收它的客户端必须使用“unexpected_message”警报终止连接。

source: Servers MUST attempt to initiate an exchange of closure alerts with the client before closing the connection.
zh_cn: 在关闭连接之前，服务器必须尝试与客户端交换关闭警报。

source: Servers MUST be able to handle the URI of any resource they serve, and SHOULD be able to handle URIs of unbounded length if they provide GET-based forms that could generate such URIs.
zh_cn: 服务器必须能够处理它们所服务的任何资源的 URI，并且如果它们提供可以生成这种 URI 的基于 GET 的表单，它应该能够处理无限长度的 URI。

source: Servers MUST be prepared to receive ClientHellos that include this extension but do not include 0x0304 in the list of versions.
zh_cn: 服务器必须准备好接收包含此扩展但在版本列表中不包含 0x0304 的 ClientHellos。

source: Servers MUST ensure that they negotiate the same cipher suite when receiving a conformant updated ClientHello (if the server selects the cipher suite as the first step in the negotiation, then this will happen automatically).
zh_cn: 服务器必须确保在接收到符合更新的 ClientHello 时协商相同的密码套件(如果服务器选择密码套件作为协商的第一步，那么这将自动发生)。

source: Servers MUST ignore unrecognized extensions.
zh_cn: 服务器必须忽略无法识别的扩展。

source: Servers MUST only select a version of TLS present in that extension and MUST ignore any unknown versions that are present in that extension.
zh_cn: 服务器必须只选择该扩展中存在的 TLS 版本，并且必须忽略该扩展中存在的任何未知版本。

source: Servers MUST send this message when authenticating via a certificate.
zh_cn: 服务器必须在通过证书进行身份验证时发送此消息。

source: Servers SHOULD NOT close a connection in the middle of transmitting a response, unless a network or client failure is suspected.
zh_cn: 除非怀疑网络或客户端故障，否则服务器不应在传输响应的过程中关闭连接。

source: Servers SHOULD NOT include MD5 and SHA-1 in CertificateRequest message.
zh_cn: 服务器不应该在 CertificateRequest 消息中包含 MD5 和 SHA-1。

source: Servers SHOULD NOT send NewSessionTicket with tickets that are not compatible with the advertised modes; however, if a server does so, the impact will just be that the client's attempts at resumption fail.
zh_cn: 服务器不应该使用与公告模式不兼容的票证发送 NewSessionTicket;但是，如果服务器这样做，那么影响就是客户端尝试恢复失败。

source: Servers SHOULD NOT send a HelloRequest immediately upon the client's initial connection.
zh_cn: 服务器不应该在客户端初始连接时立即发送 HelloRequest。

source: Servers SHOULD always respond to at least one request per connection, if at all possible.
zh_cn: 如果可能的话，服务器应该总是响应每个连接至少一个请求。

source: Servers SHOULD respond to invalid Request-URIs with an appropriate status code.
zh_cn: 服务器应该使用适当的状态代码响应无效的 Request-URI。

source: Servers and clients MUST forget any session-identifiers, keys, and secrets associated with a failed connection.
zh_cn: 服务器和客户端必须忘记与失败连接相关的任何会话标识符，密钥和机密。

source: Servers can minimize this computation cost by offering a restricted set of digest algorithms in the CertificateRequest message.
zh_cn: 服务器可以通过提供一组有限的 CertificateRequest 消息摘要算法，尽量减少这种计算成本。

source: Servers operating statelessly MUST ignore these records.
zh_cn: 无状态运行的服务器必须忽略这些记录。

source: Servers sometimes send both a current and deprecated intermediate for transitional purposes, and others are simply configured incorrectly, but these cases can nonetheless be validated properly.
zh_cn: 服务器有时会为过渡目的发送当前和已弃用的中间件，而其他服务器的配置不正确，但这些情况仍然可以正确验证。

source: Servers which are authenticating with a PSK MUST NOT send the CertificateRequest message in the main handshake, though they MAY send it in post-handshake authentication (see Section 4.6.2) provided that the client has sent the "post_handshake_auth" extension (see Section 4.2.6).
zh_cn: 使用 PSK 进行身份验证的服务器不得在主握手中发送 CertificateRequest 消息，尽管它们可以在握手后身份验证中发送它（参见第 4.6.2 节），前提是客户端已发送“post_handshake_auth”扩展（参见第 4.2.6 节）。

source: Servers will usually have some time-out value beyond which they will no longer maintain an inactive connection.
zh_cn: 服务器通常会有一些超时值，超过这个值就不再保持非活动连接。

source: Servers will usually have some timeout value beyond which they will no longer maintain an inactive connection.
zh_cn: 服务器通常会有一些超时值，超过这个值就不再保持非活动连接。

source: Several examples of connection initiation follow.
zh_cn: 下面是几个连接启动的例子。

source: Shared and Non-Shared Caches
zh_cn: 共享和非共享缓存

source: Side Effects of GET and HEAD
zh_cn: GET 和 HEAD 的副作用

source: Signature Algorithms
zh_cn: 签名算法

source: Signature algorithms are now negotiated independently (see Section 4.2.3).
zh_cn: 签名算法现在可以独立协商(参见第 4.2.3 节)。

source: Signed elements now include a field that explicitly specifies the hash algorithm used.
zh_cn: 签名元素现在包括一个显式指定使用的哈希算法的字段。

source: Similar to how error-handling became a first-class citizen and received operators to deal with it (via `onErrorXXX` operators), backpressure is another property of dataflows that the programmer has to think about and handle (via `onBackpressureXXX` operators).
zh_cn: 类似于错误处理成为一等公民并接受操作符处理它(通过 `onErrorXXX` 操作符)，背压是数据流的另一个属性，程序员必须考虑和处理(通过 `onBackpressureXXX` 操作符)。

source: Similar to the naming changes, `rx.Completable.CompletableSubscriber` has become `io.reactivex.CompletableObserver` with `onSubscribe(Disposable)`:
zh_cn: 与命名更改类似，`rx.Completable.CompletableSubscriber` 已变为 `io.reactivex.CompletableObserver`，带有 `onSubscribe(Disposable)`：

source: Similarly, "longer" can represent up to 800 bytes of data, or 400 uint16 elements, and it may be empty.
zh_cn: 类似地，“longer”可以表示多达 800 字节的数据或 400 个 uint16 元素，并且它可以是空的。（译注：uint16 为类型，0..800 表示合法长度，也就是最大长度是 800，而每个 uint16 占 2 个字节，所以最多可表示 400 个 uint，这与前面的 T T'[n] 中的 n 表示大小的倍数是不一样的）

source: Similarly, [RFC6962] provides a mechanism for a server to send a Signed Certificate Timestamp (SCT) as an extension in the ServerHello in TLS 1.2 and below.
zh_cn: 类似地，[RFC6962] 为服务器提供了一种机制，用于在 TLS 1.2 及更低版本的 ServerHello 中发送签名证书时间戳(SCT)作为扩展。

source: Similarly, if early data assumes anything about the connection state, it might be sent in error after the handshake completes.
zh_cn: 同样，如果早期数据假设有关连接状态的任何内容，则在握手完成后可能会错误地发送。

source: Simply use HTTP over TLS precisely as you would use HTTP over TCP.
zh_cn: 简单地使用 HTTP over TLS 就像使用 HTTP over TCP 一样。

source: Simultaneous Close Sequence
zh_cn: 同时关闭序列

source: Simultaneous Connection Synchronization
zh_cn: 同时连接同步

source: Simultaneous initiation is only slightly more complex, as is shown in figure 8.
zh_cn: 同时启动只是稍微复杂一些，如图 8 所示。

source: Since 1.x `Observable.subscribe(Subscriber)` returned `Subscription`, users often added the `Subscription` to a `CompositeSubscription` for example:
zh_cn: 由于 1.x `Observable.subscribe(Subscriber)` 返回 `Subscription`，用户经常将 `Subscription` 添加到 `CompositeSubscription` 中，例如：

source: Since 2.x is a fresh start, we won't make that mistake again.
zh_cn: 由于 2.x 是一个新的开始，我们不会再犯这个错误。

source: Since a server's communication options typically depend on the resource, the "*" request is only useful as a "ping" or "no-op" type of method; it does nothing beyond allowing the client to test the capabilities of the server.
zh_cn: 由于服务器的通信选项通常取决于资源，因此“*”请求仅用作“ping”或“no-op”类型的方法；除了允许客户端测试服务器的功能之外，它什么都不做。

source: Since an HTTP stream has characteristics similar to a pipe-and-filter architecture, there are no inherent limits to the extent an intermediary can enhance (or interfere) with either direction of the stream.
zh_cn: 由于 HTTP 流具有与管道和过滤器架构类似的特性，因此中间件可以增强(或干扰)流的任一方向的程度没有固有的限制。

source: Since data length in this situation is signalled by connection close a premature close generated by the server cannot be distinguished from a spurious close generated by an attacker.
zh_cn: 由于在这种情况下的数据长度通过连接关闭发出信号，因此服务器生成的过早关闭不能与攻击者生成的虚假关闭区分开。

source: Since every octet is sequenced, each of them can be acknowledged.
zh_cn: 由于每个八位字节都是有序的，因此每个八位字节都可以被确认。

source: Since handshake messages are intended to have transmission precedence over application data, it is expected that the negotiation will begin before no more than a few records are received from the client.
zh_cn: 由于握手消息旨在使传输优先于应用程序数据，因此预期协商将在从客户端接收不超过几条记录之前开始。

source: Since it cannot be combined into a single field-value, recipients ought to handle "Set-Cookie" as a special case while processing header fields.
zh_cn: 由于它不能组合成单个字段值，因此接收者应该在处理首部字段时将“Set-Cookie”作为特殊情况处理。

source: Since many of the existing code targeting 1.x do such things, the method `safeSubscribe` has been introduced that does handle these non-conforming consumers.
zh_cn: 由于许多针对 1.x 的现有代码都是这样做的，因此引入了 `safeSubscribe` 方法来处理这些不符合要求的消费者。

source: Since not all sources need all these features, the static methods of `Flowable.generate` let's one create instances without them.
zh_cn: 由于并非所有源都需要所有这些功能，因此 `Flowable.generate` 的静态方法可以创建没有它们的实例。

source: Since the "http" and "https" schemes conform to the URI generic syntax, such URIs are normalized and compared according to the algorithm defined in Section 6 of [RFC3986], using the defaults described above for each scheme.
zh_cn: 由于“http”和“https”方案符合 URI 通用语法，因此根据 [RFC3986] 第 6 节中定义的算法对这些 URI 进行归一化和比较，使用上述每个方案的默认值。

source: Since the Host field-value is critical information for handling a request, a user agent SHOULD generate Host as the first header field following the request-line.
zh_cn: 由于 Host 字段值是处理请求的关键信息，因此用户代理应该生成 Host 作为请求行之后的第一个首部字段。

source: Since the Host header field acts as an application-level routing mechanism, it is a frequent target for malware seeking to poison a shared cache or redirect a request to an unintended server.
zh_cn: 由于 Host 首部字段充当应用程序级路由机制，因此它常常是恶意软件试图中毒共享缓存或将请求重定向到非预期服务器的目标。

source: Since the Java convention is to have a lowercase letter start a method name, this would have been `return(T)` which is a keyword in Java and thus not available.
zh_cn: 由于 Java 约定是以小写字母开始一个方法名称，这将是 `return(T)`，它是 Java 中的关键字，因此不可用。

source: Since the ciphers might incorporate padding, the amount of overhead could vary with different TLSCompressed.length values.
zh_cn: 由于加密可能包含填充，因此开销量可能随着 TLSCompressed.length 值的不同而变化。

source: Since the ciphers might incorporate padding, the amount of overhead could vary with different lengths of plaintext.
zh_cn: 由于密码可能包含填充，因此开销量可能随着不同长度的明文而变化。

source: Since the elements of the enumerated are not ordered, they can be assigned any unique value, in any order.
zh_cn: 由于枚举的元素没有排序，因此可以按任何顺序为它们分配任何唯一值。

source: Since the maximum segment lifetime in the net is not likely to exceed a few tens of seconds, this is deemed ample protection for foreseeable nets, even if data rates escalate to l0's of megabits/sec.
zh_cn: 由于网络中的最大报文段寿命不可能超过几十秒，因此即使数据速率上升到 10 兆字节/秒，也可以认为这对可预见的网络提供了充足的保护。

source: Since the protocol version indicates the protocol capability of the sender, a proxy/gateway MUST NOT send a message with a version indicator which is greater than its actual version.
zh_cn: 由于协议版本指示发送方的协议能力，因此代理/网关不得发送带有的版本版本指示符大于其实际版本的消息。

source: Since the request-target often contains only part of the user agent's target URI, a server reconstructs the intended target as an "effective request URI" to properly service the request.
zh_cn: 由于请求目标通常仅包含用户代理的目标 URI 的一部分，因此服务器将预期目标重建为“有效请求 URI”以正确地为请求提供服务。

source: Since the server is not storing any state, this will appear as if it were the first message to be received.
zh_cn: 由于服务器没有存储任何状态，因此它看起来好像是第一个要接收的消息。

source: Since the space is finite, all arithmetic dealing with sequence numbers must be performed modulo 2**32.
zh_cn: 由于空间是有限的，所有处理序列号的算术必须以 2 ** 32 为模进行。

source: Since there is no predefined limit to the length of a payload, a recipient MUST anticipate potentially large decimal numerals and prevent parsing errors due to integer conversion overflows (Section 9.3).
zh_cn: 由于对有效载荷的长度没有预定义的限制，因此接收方必须预期可能存在大的十进制数字，并防止由于整数转换溢出而导致的解析错误(第 9.3 节)。

source: Since there is no way to distinguish a successfully completed, close-delimited message from a partially received message interrupted by network failure, a server SHOULD generate encoding or length-delimited messages whenever possible.
zh_cn: 由于无法区分成功完成的，近距离分隔的消息和因网络故障而中断的部分接收消息，因此服务器应尽可能生成编码或长度分隔的消息。

source: Since we assume that segments will stay in the network no more than the Maximum Segment Lifetime (MSL) and that the MSL is less than 4.55 hours we can reasonably assume that ISN's will be unique.
zh_cn: 由于我们假设网报文段将在网络中停留不超过最大网报文段生命周期(MSL)并且 MSL 小于 4.55 小时，我们可以合理地假设 ISN 将是唯一的。

source: Since we build an `Flowable` out of it, we can express our will to consume only the first 5 of it and then stop requesting anything.
zh_cn: 由于我们构建了一个 `Flowable`，我们可以表达我们的意愿，只消耗它的前 5 个，然后停止请求任何东西。

source: Since we explicitly don't request in `onStart`, this will not print anything.
zh_cn: 由于我们明确地不在 `onStart` 中请求，因此不会打印任何内容。

source: Single-byte entities containing uninterpreted data are of type opaque.
zh_cn: 包含未解释数据的单字节实体属于不透明类型。

source: Sleeping for some time in this example situations lets you see the output of the flow on the console with time to spare.
zh_cn: 在此示例情况下休眠一段时间，使您可以在留出的时间在控制台上查看流的输出。

source: Snapshots are available via https://oss.jfrog.org/libs-snapshot/io/reactivex/rxjava2/rxjava/
zh_cn: 可通过 https://oss.jfrog.org/libs-snapshot/io/reactivex/rxjava2/rxjava/ 获取快照

source: Some AEAD ciphers may additionally require a client write IV and a server write IV (see Section 6.2.3.3).
zh_cn: 一些 AEAD 加密可能还需要客户端写入 IV 和服务器写入 IV(参见第 6.2.3.3 节)。

source: Some HTTP communication options might apply only to the connection with the nearest, non-tunnel neighbor, only to the endpoints of the chain, or to all connections along the chain.
zh_cn: 某些 HTTP 通信选项可能仅适用于与最近的非隧道邻居的连接，仅适用于链的端点或链中的所有连接。

source: Some HTTP header fields allow a time value to be specified as an integer number of seconds, represented in decimal, after the time that the message was received.
zh_cn: 某些 HTTP 首部字段允许指定整数秒数的时间值，表示十进制的在收到消息之后经过的时间。

source: Some HTTP messages transfer a complete or partial representation as the message "payload".
zh_cn: 某些 HTTP 消息将完整或部分表示作为消息“payload”传输。

source: Some HTTP/1.0 software has interpreted a Content-Type header without charset parameter incorrectly to mean "recipient should guess."
zh_cn: 某些 HTTP/1.0 软件将 Content-Type 首部解释为没有 charset 参数错误地表示“收件人应该猜测”。

source: Some Notes on Naming Conventions
zh_cn: 关于命名约定的一些注释

source: Some Observable operators in RxGroovy have alternate forms that allow you to set which Scheduler the operator will use for (at least some part of) its operation.
zh_cn: RxGroovy 中的一些 Observable 操作符具有替代形式，允许您设置操作符将用于(至少某些部分)其操作的调度器。

source: Some Observable operators in RxJava have alternate forms that allow you to set which Scheduler the operator will use for (at least some part of) its operation.
zh_cn: RxJava 中的一些 Observable 操作符具有替代形式，允许您设置操作符将用于(至少某些部分)其操作的调度器。

source: Some ReactiveX Observable operators have variants that take a Scheduler as a parameter.
zh_cn: 一些 ReactiveX Observable 操作符具有将 Scheduler 作为参数的变体。

source: Some certificate extension OIDs allow multiple values (e.g., Extended Key Usage).
zh_cn: 一些证书扩展 OID 允许多个值(例如，扩展密钥使用)。

source: Some implementations make use of the userinfo component for internal configuration of authentication information, such as within command invocation options, configuration files, or bookmark lists, even though such usage might expose a user identifier or password.
zh_cn: 一些实现利用 userinfo 组件来进行认证信息的内部配置，例如在命令调用选项，配置文件或书签列表中，即使这样的使用可能暴露用户标识符或密码。

source: Some intermediaries are used to improve performance or availability.
zh_cn: 一些中介用于提高性能或可用性。

source: Some legacy pairs are left unallocated.
zh_cn: 一些遗留对未分配。

source: Some libraries offer some help, such as Google Guava's `AbstractIterable` and IxJava's `Ix.generate()` and `Ix.forloop()`.
zh_cn: 一些库提供了一些帮助，例如 Google Guava 的 `AbstractIterable` 和 IxJava 的 `Ix.generate()` 和 `Ix.forloop()`。
